#### Terraform Format and Style 🖌(prod)`success`
#### Terraform Initialization ⚙️(prod)`success`
#### Terraform Validation 🤖(prod)`success`
#### Terraform Plan 📖(prod)`success`

<details><summary>Show Plan</summary>

```terraform
module.ec2.tls_private_key.pk: Refreshing state... [id=bd92caad1b7a8262874a86a685bf39422d090e8a]
module.ec2.aws_key_pair.pk: Refreshing state... [id=rev-prod-key]
module.ec2.data.aws_availability_zones.myApp: Reading...
module.ec2.data.aws_ami.ubuntu: Reading...
module.ec2.aws_default_vpc.myApp: Refreshing state... [id=vpc-01e31438478a7b4a0]
module.s3.aws_s3_bucket.test_bucket: Refreshing state... [id=rev-prod-my-test-random-bucket-a-a-a]
module.ec2.local_file.pk: Refreshing state... [id=d0bc181f87fa6357c97d7810c7e94f4f2e7db6cf]
module.ec2.data.aws_availability_zones.myApp: Read complete after 0s [id=eu-west-2]
module.ec2.aws_default_subnet.default_az2: Refreshing state... [id=subnet-0163d1462d6e2dc84]
module.ec2.aws_default_subnet.default_az1: Refreshing state... [id=subnet-0e2c4c58a10c41418]
module.ec2.data.aws_ami.ubuntu: Read complete after 0s [id=ami-0f321d890424a6390]
module.ec2.aws_security_group.myApp: Refreshing state... [id=sg-0f4ce57cf8205df5a]
module.ec2.aws_instance.myAppone: Refreshing state... [id=i-0f5a36476222a836b]
module.ec2.aws_instance.myAppTwo: Refreshing state... [id=i-0b75cd80d4332587b]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.ec2.aws_instance.myAppTwo has been deleted
  - resource "aws_instance" "myAppTwo" {
        id                                   = "i-0b75cd80d4332587b"
      - public_ip                            = "18.133.231.138" -> null
        tags                                 = {
            "Environment" = "prod"
            "Name"        = "rev-prod-myAppTwo"
        }
        # (38 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.ec2.aws_instance.myAppone has been deleted
  - resource "aws_instance" "myAppone" {
        id                                   = "i-0f5a36476222a836b"
      - public_ip                            = "18.130.111.229" -> null
        tags                                 = {
            "Environment" = "prod"
            "Name"        = "rev-prod-myAppone"
        }
        # (37 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

  # module.ec2.aws_key_pair.pk has been deleted
  - resource "aws_key_pair" "pk" {
        id              = "rev-prod-key"
      - key_name        = "rev-prod-key" -> null
        # (8 unchanged attributes hidden)
    }

  # module.ec2.aws_security_group.myApp has been deleted
  - resource "aws_security_group" "myApp" {
      - id                     = "sg-0f4ce57cf8205df5a" -> null
        name                   = "rev-prodmyAppSG"
        # (10 unchanged attributes hidden)
    }

  # module.s3.aws_s3_bucket.test_bucket has been deleted
  - resource "aws_s3_bucket" "test_bucket" {
      - bucket                      = "rev-prod-my-test-random-bucket-a-a-a" -> null
        id                          = "rev-prod-my-test-random-bucket-a-a-a"
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ec2.aws_instance.myAppTwo will be created
  + resource "aws_instance" "myAppTwo" {
      + ami                                  = "ami-0f321d890424a6390"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "rev-prod-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "eu-west-2"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0e2c4c58a10c41418"
      + tags                                 = {
          + "Environment" = "prod"
          + "Name"        = "rev-prod-myAppTwo"
        }
      + tags_all                             = {
          + "Environment" = "prod"
          + "Name"        = "rev-prod-myAppTwo"
        }
      + tenancy                              = (known after apply)
      + user_data                            = <<-EOT
            #!/bin/bash
            sudo apt update
            sudo hostnamectl set-hostname python-server
            sudo apt install python3-pip unzip -y
            sudo apt install postgresql postgresql-contrib -y
            sudo systemctl start postgresql.service
            sudo apt install python3.8-venv
            curl -fsSL https://deb.nodesource.com/setup_20.x | sudo -E bash -
            sudo apt-get install nodejs -y
            sudo apt install npm  -y
            sudo apt install -y awslogs  # Ubuntu/Debian
            curl "https://awscli.amazonaws.com/awscli-exe-linux-x86_64.zip" -o "awscliv2.zip"
            unzip awscliv2.zip
            sudo ./aws/install
            mkdir /home/ubuntu/react-django-project
            sudo chown -R ubuntu:ubuntu /home/ubuntu/react-django-project
            sudo su -c "git clone https://github.com/daveacho/myNotes.git" ubuntu
            sudo apt install -y wget curl expect
            
            # Install pgAdmin 4
            curl https://www.pgadmin.org/static/packages_pgadmin_org.pub | sudo gpg --dearmor -o /usr/share/keyrings/packages-pgadmin-org.gpg
            echo "deb [signed-by=/usr/share/keyrings/packages-pgadmin-org.gpg] https://ftp.postgresql.org/pub/pgadmin/pgadmin4/apt/$(lsb_release -cs) pgadmin4 main" | sudo tee /etc/apt/sources.list.d/pgadmin4.list
            sudo apt update -y
            sudo apt install -y pgadmin4
            
            # Automate the pgAdmin 4 web setup
            expect <<EOT
            spawn sudo /usr/pgadmin4/bin/setup-web.sh
            expect "Email address:" 
            send "john@example.com\r"
            expect "Password:"
            send "Password123\r"
            expect "Retype password:"
            send "Password123\r"
            expect eof
            EOT
            
            # Restart Apache to apply changes (if using Apache as the web server)
            sudo systemctl restart apache2
        EOT
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.ec2.aws_instance.myAppone will be created
  + resource "aws_instance" "myAppone" {
      + ami                                  = "ami-0f321d890424a6390"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "rev-prod-key"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "eu-west-2"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0e2c4c58a10c41418"
      + tags                                 = {
          + "Environment" = "prod"
          + "Name"        = "rev-prod-myAppone"
        }
      + tags_all                             = {
          + "Environment" = "prod"
          + "Name"        = "rev-prod-myAppone"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

  # module.ec2.aws_key_pair.pk will be created
  + resource "aws_key_pair" "pk" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "rev-prod-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDDjGm7jYNReXkleDiGnFFR4WaNwJryEss28oIxAe/ZlvQSdtLb40o1pMVSzYD+ds+mOiBHoDo7RemaMiDB7YPEHRr1luYUfwJ4jiVgBatBzQLQy1W/4k4uLya/0794ISxIFdLN7AO4j6SV4itoUxwTUTPSSXPhJ2lr03U9VRHS1kcyjhlWW9JnJ9po658wh6BHTbHjbgUTLLmKWP28Tc0TqBwYr9xBIiircpS6oNLLO2LtQEDJ1HCSRggOv+jnHZ0RnMt8TMPLRSFdEc5bpRSFXXc+h93ZjlR0y3QzGxKqBvNiYDjB1eA9yaPCdG+FkjD3QEUCynDRWG2p88AMULqiM48blj8uUnfPMQtOvcBb9RL26h+k6MH2ey82yeXG5fHjKLVc8bit7jlc7FDznZcxGmgdFmky1bApRUAOUK0utZp6RQuD72HCs/S+ysuZ0CRSJU7UZDsJ3JwcXhnPOfWIJAELEVOPLX0sbGHy+84lp8d+LdAGv+mHNWyVI62QqDRC+x1OqmKaSLUwODkrWI2rDvu/xvlvWbWVT8/jh5qFofiEyLoLFtjVRFrbyf4o/q1V/791Vqp648/j54wH9n4DGcGGub0o7J9v259ecMOxcwe5IuURFXNx7PdxQuU4pFJjalTxCQHQMwhhcFTftVDCNXvWSAcxW9NseDcgtdRZGw=="
      + region          = "eu-west-2"
      + tags_all        = (known after apply)
    }

  # module.ec2.aws_security_group.myApp will be created
  + resource "aws_security_group" "myApp" {
      + arn                    = (known after apply)
      + description            = "Allow access on ports 0 to 60000"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "allow traffic from ports range from 0 to 60000"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 60000
            },
        ]
      + name                   = "rev-prodmyAppSG"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-2"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-01e31438478a7b4a0"
    }

  # module.ec2.local_file.pk will be created
  + resource "local_file" "pk" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "rev-prod-key.pem"
      + id                   = (known after apply)
    }

  # module.s3.aws_s3_bucket.test_bucket will be created
  + resource "aws_s3_bucket" "test_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "rev-prod-my-test-random-bucket-a-a-a"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-west-2"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ ec2-one-ip     = "18.130.111.229" -> (known after apply)
  ~ ec2-two-ip     = "18.133.231.138" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @daveacho, Action: `pull_request`, Workflow: `Pull Request on Prod environment`*